public class Application {

  public static void main(String[] args) {
    // Git - отдельная программа реализующая функции системы контроля версий
    // назначением которой является хранение истории изменений произведённых в
    // рамках репозитория. В истории хранится информация об авторе изменений, о
    // дате и времени и самих изменениях.

    // Репозиторий - каталог относительно которого будут отслеживаться
    // изменения.

    // Git репозиторий может хранить несколько параллельно существующих веток,
    // в каждой ветке состояние проекта может отличаться от остальных веток, но
    // при этом всегда должна быть основная от которой будут идти остальные.

    // Ветка - отдельное пространство в котором проект хранится в определенном
    // состоянии.

    // `git init` - инициализирует новый репозиторий в том каталоге из
    // которого команда выполняется.

    // `git status` - выводит информацию о состоянии репозитория на момент
    // выполнения команды.

    // `git add <files>` - добавляет файл для дальнейшей фиксации в истории
    // изменений. Файл добавляется в том состоянии в котором он был на момент
    // написания команды.
  }
}










